[
  {
    "ideal": "You should not accept a postdated check. Inform the customer that checks must be dated for the current date.",
    "red_flags": [
      "Postdated check"
    ],
    "policy": "Per policy, checks must reflect the date of transaction."
  },
  {
    "ideal": "Refuse the check. Politely explain that ID is required for all check payments.",
    "red_flags": [
      "Customer refuses ID"
    ],
    "policy": "A valid photo ID is required for all checks, no exceptions."
  },
  {
    "ideal": "Do not accept the check. Checks must be pre-printed with the account holder’s name and address.",
    "red_flags": [
      "Handwritten check with no identity"
    ],
    "policy": "Handwritten checks without printed information are not accepted."
  },
  {
    "ideal": "Ask the customer to pause their call. You must confirm the amount and payment method clearly.",
    "red_flags": [
      "Customer is distracted",
      "Potential mistake in tendering"
    ],
    "policy": "Cashiers must confirm payments without distractions to ensure accuracy."
  },
  {
    "ideal": "Politely decline the check. Checks made out to 'Cash' are not accepted.",
    "red_flags": [
      "Check made out to 'Cash'"
    ],
    "policy": "Checks must be made out to your agency, not to 'Cash'."
  },
  {
    "ideal": "Inspect the bill further or escalate. Faded bills lacking security features must be verified.",
    "red_flags": [
      "Suspicious or counterfeit currency"
    ],
    "policy": "Follow counterfeit protocol and do not accept if authenticity is in doubt."
  },
  {
    "ideal": "Count the drawer and verify what was received. Politely explain what your records show.",
    "red_flags": [
      "Dispute about payment"
    ],
    "policy": "All over/short concerns must be verified via drawer count and supervisor if needed."
  },
  {
    "ideal": "Return the check. All written and numeric values must match.",
    "red_flags": [
      "Check mismatch"
    ],
    "policy": "Mismatched amounts invalidate a check. Do not process it."
  },
  {
    "ideal": "You may accept the cash, but must complete a large cash payment form per policy.",
    "red_flags": [
      "Large cash transaction"
    ],
    "policy": "Cash payments over $1000 require additional documentation and supervisor notice."
  },
  {
    "ideal": "Do not process the check. It must be signed before acceptance.",
    "red_flags": [
      "Unsigned check"
    ],
    "policy": "All checks must be signed by the account holder at the time of transaction."
  },
  {
    "ideal": "Politely explain that you cannot accept large payments entirely in coins. Suggest exchanging them at a bank.",
    "red_flags": [
      "Excessive coins",
      "Disruption of line flow"
    ],
    "policy": "Cash payments must be reasonable to process. Large coin counts may be declined."
  },
  {
    "ideal": "Explain that you cannot give change for checks. Suggest writing it for the exact amount.",
    "red_flags": [
      "Customer asking for cash back on check"
    ],
    "policy": "Never issue cash back from checks. This violates policy and opens risk."
  },
  {
    "ideal": "Refuse the bill and treat it as counterfeit. Do not accuse the customer, but escalate.",
    "red_flags": [
      "Novelty or fake money"
    ],
    "policy": "If a bill appears fake, follow counterfeit procedures immediately."
  },
  {
    "ideal": "Decline the check. It is considered stale-dated and should not be accepted.",
    "red_flags": [
      "Old/stale-dated check"
    ],
    "policy": "Checks must be dated within 30 days of acceptance."
  },
  {
    "ideal": "Thank them, but do not skip verification. All checks require standard review.",
    "red_flags": [
      "Pressure to skip verification"
    ],
    "policy": "No matter the demeanor, all checks must be verified per policy."
  },
  {
    "ideal": "Refuse the check. Any check marked VOID is invalid.",
    "red_flags": [
      "VOID check"
    ],
    "policy": "Checks labeled VOID may not be accepted under any circumstance."
  },
  {
    "ideal": "Split the payment properly and confirm both methods. Each must follow its own process.",
    "red_flags": [
      "Split tender confusion"
    ],
    "policy": "Split payments must be clearly recorded with accurate totals per method."
  },
  {
    "ideal": "Remain calm, walk through the receipt process slowly, and invite supervisor assistance if needed.",
    "red_flags": [
      "Customer distrust",
      "Payment over $1000"
    ],
    "policy": "Ensure professionalism and double-count when customer history includes disputes."
  },
  {
    "ideal": "Accept the coins only if the amount is reasonable to count and process in line.",
    "red_flags": [
      "Disruption of line",
      "Stalling tactic"
    ],
    "policy": "Coin limits apply. You may refuse or ask them to convert coins to paper money first."
  },
  {
    "ideal": "Take your time. Double-check the date, signature, and amounts before accepting the check.",
    "red_flags": [
      "Rushed interaction",
      "Missed verification steps"
    ],
    "policy": "Distractions increase mistakes. Stay focused and follow full check acceptance protocol."
  }
]