[
  {
    "question": "A customer is paying $425.75 by check, but the check is postdated by 3 days. How do you handle it?",
    "ideal": "Politely inform the customer that postdated checks are not accepted. Request a check with today's date or an alternative payment method.",
    "red_flag": "Postdated checks can be used to avoid insufficient funds holds or to delay payment verification.",
    "policy": "All checks must be dated for the current day. Postdated checks are not acceptable."
  },
  {
    "question": "A customer is paying $31.25 by check but refuses to show any ID. How do you handle it?",
    "ideal": "Inform the customer that a valid ID is required for all checks. Decline the payment if they refuse.",
    "red_flag": "Refusing to show ID could indicate an attempt at fraud or misrepresentation.",
    "policy": "Per cashiering policy, all checks must be verified with valid government-issued ID."
  },
  {
    "question": "A customer attempts to pay $2675.00 by check. The check is handwritten and has no printed name or address. How do you handle this?",
    "ideal": "Inform the customer that checks must include preprinted identifying information. Ask for a valid alternative payment method.",
    "red_flag": "Checks without printed information may be forged or drawn on closed accounts.",
    "policy": "Checks must include printed name, address, and must be legible."
  },
  {
    "question": "A customer tries to pay $36.10 in cash while talking on their phone and not paying attention. How do you handle it?",
    "ideal": "Ask the customer to pause their call and confirm the transaction. Politely ensure you have their full attention.",
    "red_flag": "Inattentive customers may later dispute the transaction or claim they gave a different amount.",
    "policy": "Clerks must confirm payment amounts clearly before finalizing the transaction."
  },
  {
    "question": "A customer hands you a check for $239.89 made out to 'Cash'. What should you do?",
    "ideal": "Inform the customer that checks must be made out to the agency, not 'Cash'. Decline the check.",
    "red_flag": "Checks to 'Cash' are easily misused and untraceable if lost or stolen.",
    "policy": "Checks must be written to the correct payee and not to 'Cash'."
  },
  {
    "question": "You're handed $156.25 in cash, but one of the bills is suspiciously faded and lacks a security strip. What should you do?",
    "ideal": "Set the bill aside and follow counterfeit policy procedures. Use a counterfeit pen or notify a supervisor.",
    "red_flag": "Counterfeit bills may appear worn or altered. Lack of security features is a key sign.",
    "policy": "Clerks must verify large bills for authenticity and report suspected counterfeits immediately."
  },
  {
    "question": "Customer pays $88.40 in cash, then insists they gave you a $100 bill instead of a $20. How do you respond?",
    "ideal": "Verify against your drawer and camera if possible. Politely stand by the drawer count if no mistake is found.",
    "red_flag": "Claiming to give more money is a common distraction or scam tactic.",
    "policy": "Clerks must verify bills before placing them in the drawer and follow over/short reporting if needed."
  },
  {
    "question": "You receive a check for $54.25, but the written amount and numeric amount do not match. What do you do?",
    "ideal": "Return the check and ask the customer to correct it or provide a new one. Do not process as-is.",
    "red_flag": "Discrepant amounts can invalidate checks or signal tampering.",
    "policy": "Both written and numeric fields on checks must match exactly."
  },
  {
    "question": "A customer wants to pay $1200 in cash for property taxes. What steps should you take?",
    "ideal": "Accept the payment but follow policy for large cash transactions, such as documenting serial numbers or completing cash report forms.",
    "red_flag": "Large cash payments may be associated with money laundering or evasion of reporting.",
    "policy": "Payments over $1000 in cash require additional verification steps per agency policy."
  },
  {
    "question": "You’re handed a check for $46.10, but it’s missing a signature. What should you do?",
    "ideal": "Inform the customer the check cannot be accepted without a signature and ask them to sign it in your presence.",
    "red_flag": "Unsigned checks are invalid and may be a sign of an unintentional or fraudulent submission.",
    "policy": "Checks must be signed by the account holder at the time of payment."
  },
  {
    "question": "A customer attempts to pay $2675.00 using only coins. What should you do?",
    "ideal": "Politely inform the customer there is a limit on coin payments and suggest using rolled coins or a different method.",
    "red_flag": "Excessive coin use may be a disruption tactic or protest behavior.",
    "policy": "Offices may restrict coin payments to rolled coins or impose quantity limits."
  },
  {
    "question": "A customer writes a check for $46.10 and asks for $20 back in cash. What’s your response?",
    "ideal": "Inform the customer that checks cannot be written over for cash back. Decline the request.",
    "red_flag": "Check cash back requests can be used for fraud or money laundering.",
    "policy": "No cash back is allowed on check transactions."
  },
  {
    "question": "You’re handed $31.25 in cash but notice one bill says 'For Motion Picture Use Only'. What do you do?",
    "ideal": "Politely inform the customer the bill is not legal tender. Ask for valid payment.",
    "red_flag": "Prop money is often used as counterfeit. Accepting it creates loss liability.",
    "policy": "All payment must be in legal tender. Fake or novelty bills must be refused."
  },
  {
    "question": "A customer submits a check dated from last month for $36.10. What should you do?",
    "ideal": "Check your policy on stale-dated checks. If outside the valid window, decline and request a current date.",
    "red_flag": "Old checks may be rejected by banks or suggest a delay tactic.",
    "policy": "Checks older than 30 days may not be accepted per agency policy."
  },
  {
    "question": "A customer insists they don’t want you to verify their check through the system. What should you do?",
    "ideal": "Inform them verification is standard and required. Decline the check if they refuse.",
    "red_flag": "Avoiding verification may signal fear of rejection due to insufficient funds or fraud.",
    "policy": "All checks must be verified via the agency’s verification system."
  },
  {
    "question": "A check for $88.40 has ‘VOID’ faintly written across it. How do you respond?",
    "ideal": "Politely inform the customer the check is voided and cannot be accepted. Ask for a new check.",
    "red_flag": "Void-marked checks are invalid and may not be honored by banks.",
    "policy": "Checks must be clean, legible, and free from void marks."
  },
  {
    "question": "A customer wants to split a $239.89 payment between cash and check. What do you do?",
    "ideal": "Accept split payments if allowed. Record both amounts accurately and issue one receipt.",
    "red_flag": "Confusion over split payments can lead to drawer errors if not tracked properly.",
    "policy": "Split tender payments must be clearly documented and balanced."
  },
  {
    "question": "Customer pays $1200 by check and watches every move, citing being shorted last visit. What do you do?",
    "ideal": "Stay calm and follow procedures. Count aloud and involve a second employee if needed.",
    "red_flag": "Overwatching may be due to distrust or setup for a false claim.",
    "policy": "Clerks should follow verification protocol and provide full transparency for all transactions."
  },
  {
    "question": "Customer brings $54.25 entirely in nickels and dimes. What do you do?",
    "ideal": "Accept if within policy, but request coins be rolled or counted before accepting.",
    "red_flag": "Unrolled small coins can delay service and disrupt the drawer.",
    "policy": "Unrolled coin payments may be limited or require supervisor approval."
  },
  {
    "question": "Customer is paying $156.25 by check but appears distracted and in a rush. What should you do?",
    "ideal": "Ask the customer to pause and review their check with you. Ensure all fields are filled out.",
    "red_flag": "Rushed behavior may lead to errors or missing information.",
    "policy": "Clerks must verify all fields on a check are complete before processing."
  }
]